hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/inc/hw_mcan.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_PSR register
//
//*****************************************************************************
#define MCAN_PSR_LEC_S            0U
#define MCAN_PSR_LEC_M            0x7U         // Last Error Code
#define MCAN_PSR_ACT_S            3U
#define MCAN_PSR_ACT_M            0x18U        // Node Activity
#define MCAN_PSR_EP               0x20U        // Error Passive
#define MCAN_PSR_EW               0x40U        // Warning Status
#define MCAN_PSR_BO               0x80U        // Bus_Off Status
#define MCAN_PSR_DLEC_S           8U
#define MCAN_PSR_DLEC_M           0x700U       // Data Phase Last Error Code
#define MCAN_PSR_RESI             0x800U       // ESI Flag of Last Received CAN
                                               // FD Message
#define MCAN_PSR_RBRS             0x1000U      // BRS Flag of Last Received CAN
                                               // FD Message
#define MCAN_PSR_RFDF             0x2000U      // Received a CAN FD Message
#define MCAN_PSR_PXE              0x4000U      // Protocol Exception Event
#define MCAN_PSR_TDCV_S           16U
#define MCAN_PSR_TDCV_M           0x7F0000U    // Transmitter Delay
                                               // Compensation Value

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TDCR register
//
//*****************************************************************************
#define MCAN_TDCR_TDCF_S          0U
#define MCAN_TDCR_TDCF_M          0x7FU        // Transmitter Delay
                                               // Compensation Filter Window Length
#define MCAN_TDCR_TDCO_S          8U
#define MCAN_TDCR_TDCO_M          0x7F00U      // Transmitter Delay
                                               // Compensation Offset

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_IR register
//
//*****************************************************************************
#define MCAN_IR_RF0N              0x1U         // Rx FIFO 0 New Message
#define MCAN_IR_RF0W              0x2U         // Rx FIFO 0 Watermark Reached
#define MCAN_IR_RF0F              0x4U         // Rx FIFO 0 Full
#define MCAN_IR_RF0L              0x8U         // Rx FIFO 0 Message Lost
#define MCAN_IR_RF1N              0x10U        // Rx FIFO 1 New Message
#define MCAN_IR_RF1W              0x20U        // Rx FIFO 1 Watermark Reached
#define MCAN_IR_RF1F              0x40U        // Rx FIFO 1 Full
#define MCAN_IR_RF1L              0x80U        // Rx FIFO 1 Message Lost
#define MCAN_IR_HPM               0x100U       // High Priority Message
#define MCAN_IR_TC                0x200U       // Transmission Completed
#define MCAN_IR_TCF               0x400U       // Transmission Cancellation
                                               // Finished
#define MCAN_IR_TFE               0x800U       // Tx FIFO Empty
#define MCAN_IR_TEFN              0x1000U      // Tx Event FIFO New Entry
#define MCAN_IR_TEFW              0x2000U      // Tx Event FIFO Watermark
                                               // Reached
#define MCAN_IR_TEFF              0x4000U      // Tx Event FIFO Full
#define MCAN_IR_TEFL              0x8000U      // Tx Event FIFO Element Lost
#define MCAN_IR_TSW               0x10000U     // Timestamp Wraparound
#define MCAN_IR_MRAF              0x20000U     // Message RAM Access Failure
#define MCAN_IR_TOO               0x40000U     // Timeout Occurred
#define MCAN_IR_DRX               0x80000U     // Message Stored to Dedicated
                                               // Rx Buffer
#define MCAN_IR_BEU               0x200000U    // Bit Error Uncorrected
#define MCAN_IR_ELO               0x400000U    // Error Logging Overflow
#define MCAN_IR_EP                0x800000U    // Error Passive
#define MCAN_IR_EW                0x1000000U   // Warning Status
#define MCAN_IR_BO                0x2000000U   // Bus_Off Status
#define MCAN_IR_WDI               0x4000000U   // Watchdog Interrupt
#define MCAN_IR_PEA               0x8000000U   // Protocol Error in Arbitration
                                               // Phase
#define MCAN_IR_PED               0x10000000U  // Protocol Error in Data Phase
#define MCAN_IR_ARA               0x20000000U  // Access to Reserved Address

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_IE register
//
//*****************************************************************************
#define MCAN_IE_RF0NE             0x1U         // Rx FIFO 0 New Message Enable
#define MCAN_IE_RF0WE             0x2U         // Rx FIFO 0 Watermark Reached
                                               // Enable
#define MCAN_IE_RF0FE             0x4U         // Rx FIFO 0 Full Enable
#define MCAN_IE_RF0LE             0x8U         // Rx FIFO 0 Message Lost Enable
#define MCAN_IE_RF1NE             0x10U        // Rx FIFO 1 New Message Enable
#define MCAN_IE_RF1WE             0x20U        // Rx FIFO 1 Watermark Reached
                                               // Enable
#define MCAN_IE_RF1FE             0x40U        // Rx FIFO 1 Full Enable
#define MCAN_IE_RF1LE             0x80U        // Rx FIFO 1 Message Lost Enable
#define MCAN_IE_HPME              0x100U       // High Priority Message Enable
#define MCAN_IE_TCE               0x200U       // Transmission Completed Enable
#define MCAN_IE_TCFE              0x400U       // Transmission Cancellation
                                               // Finished Enable
#define MCAN_IE_TFEE              0x800U       // Tx FIFO Empty Enable
#define MCAN_IE_TEFNE             0x1000U      // Tx Event FIFO New Entry
                                               // Enable
#define MCAN_IE_TEFWE             0x2000U      // Tx Event FIFO Watermark
                                               // Reached Enable
#define MCAN_IE_TEFFE             0x4000U      // Tx Event FIFO Full Enable
#define MCAN_IE_TEFLE             0x8000U      // Tx Event FIFO Element Lost
                                               // Enable
#define MCAN_IE_TSWE              0x10000U     // Timestamp Wraparound Enable
#define MCAN_IE_MRAFE             0x20000U     // Message RAM Access Failure
                                               // Enable
#define MCAN_IE_TOOE              0x40000U     // Timeout Occurred Enable
#define MCAN_IE_DRXE              0x80000U     // Message Stored to Dedicated
                                               // Rx Buffer Enable
#define MCAN_IE_BECE              0x100000U    // Bit Error Corrected Enable
#define MCAN_IE_BEUE              0x200000U    // Bit Error Uncorrected Enable
#define MCAN_IE_ELOE              0x400000U    // Error Logging Overflow Enable
#define MCAN_IE_EPE               0x800000U    // Error Passive Enable
#define MCAN_IE_EWE               0x1000000U   // Warning Status Enable
#define MCAN_IE_BOE               0x2000000U   // Bus_Off Status Enable
#define MCAN_IE_WDIE              0x4000000U   // Watchdog Interrupt Enable
#define MCAN_IE_PEAE              0x8000000U   // Protocol Error in Arbitration
                                               // Phase Enable
#define MCAN_IE_PEDE              0x10000000U  // Protocol Error in Data Phase
                                               // Enable
#define MCAN_IE_ARAE              0x20000000U  // Access to Reserved Address
                                               // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_ILS register
//
//*****************************************************************************
#define MCAN_ILS_RF0NL            0x1U         // Rx FIFO 0 New Message Line
#define MCAN_ILS_RF0WL            0x2U         // Rx FIFO 0 Watermark Reached
                                               // Line
#define MCAN_ILS_RF0FL            0x4U         // Rx FIFO 0 Full Line
#define MCAN_ILS_RF0LL            0x8U         // Rx FIFO 0 Message Lost Line
#define MCAN_ILS_RF1NL            0x10U        // Rx FIFO 1 New Message Line
#define MCAN_ILS_RF1WL            0x20U        // Rx FIFO 1 Watermark Reached
                                               // Line
#define MCAN_ILS_RF1FL            0x40U        // Rx FIFO 1 Full Line
#define MCAN_ILS_RF1LL            0x80U        // Rx FIFO 1 Message Lost Line
#define MCAN_ILS_HPML             0x100U       // High Priority Message Line
#define MCAN_ILS_TCL              0x200U       // Transmission Completed Line
#define MCAN_ILS_TCFL             0x400U       // Transmission Cancellation
                                               // Finished Line
#define MCAN_ILS_TFEL             0x800U       // Tx FIFO Empty Line
#define MCAN_ILS_TEFNL            0x1000U      // Tx Event FIFO New Entry Line
#define MCAN_ILS_TEFWL            0x2000U      // Tx Event FIFO Watermark
                                               // Reached Line
#define MCAN_ILS_TEFFL            0x4000U      // Tx Event FIFO Full Line
#define MCAN_ILS_TEFLL            0x8000U      // Tx Event FIFO Element Lost
                                               // Line
#define MCAN_ILS_TSWL             0x10000U     // Timestamp Wraparound Line
#define MCAN_ILS_MRAFL            0x20000U     // Message RAM Access Failure
                                               // Line
#define MCAN_ILS_TOOL             0x40000U     // Timeout Occurred Line
#define MCAN_ILS_DRXL             0x80000U     // Message Stored to Dedicated
                                               // Rx Buffer Line
#define MCAN_ILS_BECL             0x100000U    // Bit Error Corrected Line
#define MCAN_ILS_BEUL             0x200000U    // Bit Error Uncorrected Line
#define MCAN_ILS_ELOL             0x400000U    // Error Logging Overflow Line
#define MCAN_ILS_EPL              0x800000U    // Error Passive Line
#define MCAN_ILS_EWL              0x1000000U   // Warning Status Line
#define MCAN_ILS_BOL              0x2000000U   // Bus_Off Status Line
#define MCAN_ILS_WDIL             0x4000000U   // Watchdog Interrupt Line
#define MCAN_ILS_PEAL             0x8000000U   // Protocol Error in Arbitration
                                               // Phase Line
#define MCAN_ILS_PEDL             0x10000000U  // Protocol Error in Data Phase
                                               // Line
#define MCAN_ILS_ARAL             0x20000000U  // Access to Reserved Address
                                               // Line

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_ILE register
//
//*****************************************************************************
#define MCAN_ILE_EINT0            0x1U         // Enable Interrupt Line 0
#define MCAN_ILE_EINT1            0x2U         // Enable Interrupt Line 1

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_GFC register
//
//*****************************************************************************
#define MCAN_GFC_RRFE             0x1U         // Reject Remote Frames Extended
#define MCAN_GFC_RRFS             0x2U         // Reject Remote Frames Standard
#define MCAN_GFC_ANFE_S           2U
#define MCAN_GFC_ANFE_M           0xCU         // Accept Non-matching Frames
                                               // Extended
#define MCAN_GFC_ANFS_S           4U
#define MCAN_GFC_ANFS_M           0x30U        // Accept Non-matching Frames
                                               // Standard

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_SIDFC register
//
//*****************************************************************************
#define MCAN_SIDFC_FLSSA_S        2U
#define MCAN_SIDFC_FLSSA_M        0xFFFCU      // Filter List Standard Start
                                               // Address
#define MCAN_SIDFC_LSS_S          16U
#define MCAN_SIDFC_LSS_M          0xFF0000U    // List Size Standard

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_XIDFC register
//
//*****************************************************************************
#define MCAN_XIDFC_FLESA_S        2U
#define MCAN_XIDFC_FLESA_M        0xFFFCU      // Filter List Extended Start
                                               // Address
#define MCAN_XIDFC_LSE_S          16U
#define MCAN_XIDFC_LSE_M          0x7F0000U    // List Size Extended

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_XIDAM register
//
//*****************************************************************************
#define MCAN_XIDAM_EIDM_S         0U
#define MCAN_XIDAM_EIDM_M         0x1FFFFFFFU  // Extended ID Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_HPMS register
//
//*****************************************************************************
#define MCAN_HPMS_BIDX_S          0U
#define MCAN_HPMS_BIDX_M          0x3FU        // Buffer Index
#define MCAN_HPMS_MSI_S           6U
#define MCAN_HPMS_MSI_M           0xC0U        // Message Storage Indicator
#define MCAN_HPMS_FIDX_S          8U
#define MCAN_HPMS_FIDX_M          0x7F00U      // Filter Index
#define MCAN_HPMS_FLST            0x8000U      // Filter List

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_NDAT1 register
//
//*****************************************************************************
#define MCAN_NDAT1_ND0            0x1U         // New Data RX Buffer 0
#define MCAN_NDAT1_ND1            0x2U         // New Data RX Buffer 1
#define MCAN_NDAT1_ND2            0x4U         // New Data RX Buffer 2
#define MCAN_NDAT1_ND3            0x8U         // New Data RX Buffer 3
#define MCAN_NDAT1_ND4            0x10U        // New Data RX Buffer 4
#define MCAN_NDAT1_ND5            0x20U        // New Data RX Buffer 5
#define MCAN_NDAT1_ND6            0x40U        // New Data RX Buffer 6
#define MCAN_NDAT1_ND7            0x80U        // New Data RX Buffer 7
#define MCAN_NDAT1_ND8            0x100U       // New Data RX Buffer 8
#define MCAN_NDAT1_ND9            0x200U       // New Data RX Buffer 9
#define MCAN_NDAT1_ND10           0x400U       // New Data RX Buffer 10
#define MCAN_NDAT1_ND11           0x800U       // New Data RX Buffer 11
#define MCAN_NDAT1_ND12           0x1000U      // New Data RX Buffer 12
#define MCAN_NDAT1_ND13           0x2000U      // New Data RX Buffer 13
#define MCAN_NDAT1_ND14           0x4000U      // New Data RX Buffer 14
#define MCAN_NDAT1_ND15           0x8000U      // New Data RX Buffer 15
#define MCAN_NDAT1_ND16           0x10000U     // New Data RX Buffer 16
#define MCAN_NDAT1_ND17           0x20000U     // New Data RX Buffer 17
#define MCAN_NDAT1_ND18           0x40000U     // New Data RX Buffer 18
#define MCAN_NDAT1_ND19           0x80000U     // New Data RX Buffer 19
#define MCAN_NDAT1_ND20           0x100000U    // New Data RX Buffer 20
#define MCAN_NDAT1_ND21           0x200000U    // New Data RX Buffer 21
#define MCAN_NDAT1_ND22           0x400000U    // New Data RX Buffer 22
#define MCAN_NDAT1_ND23           0x800000U    // New Data RX Buffer 23
#define MCAN_NDAT1_ND24           0x1000000U   // New Data RX Buffer 24
#define MCAN_NDAT1_ND25           0x2000000U   // New Data RX Buffer 25
#define MCAN_NDAT1_ND26           0x4000000U   // New Data RX Buffer 26
#define MCAN_NDAT1_ND27           0x8000000U   // New Data RX Buffer 27
#define MCAN_NDAT1_ND28           0x10000000U  // New Data RX Buffer 28
#define MCAN_NDAT1_ND29           0x20000000U  // New Data RX Buffer 29
#define MCAN_NDAT1_ND30           0x40000000U  // New Data RX Buffer 30
#define MCAN_NDAT1_ND31           0x80000000U  // New Data RX Buffer 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_NDAT2 register
//
//*****************************************************************************
#define MCAN_NDAT2_ND32           0x1U         // New Data RX Buffer 32
#define MCAN_NDAT2_ND33           0x2U         // New Data RX Buffer 33
#define MCAN_NDAT2_ND34           0x4U         // New Data RX Buffer 34
#define MCAN_NDAT2_ND35           0x8U         // New Data RX Buffer 35
#define MCAN_NDAT2_ND36           0x10U        // New Data RX Buffer 36
#define MCAN_NDAT2_ND37           0x20U        // New Data RX Buffer 37
#define MCAN_NDAT2_ND38           0x40U        // New Data RX Buffer 38
#define MCAN_NDAT2_ND39           0x80U        // New Data RX Buffer 39
#define MCAN_NDAT2_ND40           0x100U       // New Data RX Buffer 40
#define MCAN_NDAT2_ND41           0x200U       // New Data RX Buffer 41
#define MCAN_NDAT2_ND42           0x400U       // New Data RX Buffer 42
#define MCAN_NDAT2_ND43           0x800U       // New Data RX Buffer 43
#define MCAN_NDAT2_ND44           0x1000U      // New Data RX Buffer 44
#define MCAN_NDAT2_ND45           0x2000U      // New Data RX Buffer 45
#define MCAN_NDAT2_ND46           0x4000U      // New Data RX Buffer 46
#define MCAN_NDAT2_ND47           0x8000U      // New Data RX Buffer 47
#define MCAN_NDAT2_ND48           0x10000U     // New Data RX Buffer 48
#define MCAN_NDAT2_ND49           0x20000U     // New Data RX Buffer 49
#define MCAN_NDAT2_ND50           0x40000U     // New Data RX Buffer 50
#define MCAN_NDAT2_ND51           0x80000U     // New Data RX Buffer 51
#define MCAN_NDAT2_ND52           0x100000U    // New Data RX Buffer 52
#define MCAN_NDAT2_ND53           0x200000U    // New Data RX Buffer 53
#define MCAN_NDAT2_ND54           0x400000U    // New Data RX Buffer 54
#define MCAN_NDAT2_ND55           0x800000U    // New Data RX Buffer 55
#define MCAN_NDAT2_ND56           0x1000000U   // New Data RX Buffer 56
#define MCAN_NDAT2_ND57           0x2000000U   // New Data RX Buffer 57
#define MCAN_NDAT2_ND58           0x4000000U   // New Data RX Buffer 58
#define MCAN_NDAT2_ND59           0x8000000U   // New Data RX Buffer 59
#define MCAN_NDAT2_ND60           0x10000000U  // New Data RX Buffer 60
#define MCAN_NDAT2_ND61           0x20000000U  // New Data RX Buffer 61
#define MCAN_NDAT2_ND62           0x40000000U  // New Data RX Buffer 62
#define MCAN_NDAT2_ND63           0x80000000U  // New Data RX Buffer 63

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXF0C register
//
//*****************************************************************************
#define MCAN_RXF0C_F0SA_S         2U
#define MCAN_RXF0C_F0SA_M         0xFFFCU      // Rx FIFO 0 Start Address
#define MCAN_RXF0C_F0S_S          16U
#define MCAN_RXF0C_F0S_M          0x7F0000U    // Rx FIFO 0 Size
#define MCAN_RXF0C_F0WM_S         24U
#define MCAN_RXF0C_F0WM_M         0x7F000000U  // Rx FIFO 0 Watermark
#define MCAN_RXF0C_F0OM           0x80000000U  // FIFO 0 Operation Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXF0S register
//
//*****************************************************************************
#define MCAN_RXF0S_F0FL_S         0U
#define MCAN_RXF0S_F0FL_M         0x7FU        // Rx FIFO 0 Fill Level
#define MCAN_RXF0S_F0GI_S         8U
#define MCAN_RXF0S_F0GI_M         0x3F00U      // Rx FIFO 0 Get Index
#define MCAN_RXF0S_F0PI_S         16U
#define MCAN_RXF0S_F0PI_M         0x3F0000U    // Rx FIFO 0 Put Index
#define MCAN_RXF0S_F0F            0x1000000U   // Rx FIFO 0 Full
#define MCAN_RXF0S_RF0L           0x2000000U   // Rx FIFO 0 Message Lost

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXF0A register
//
//*****************************************************************************
#define MCAN_RXF0A_F0AI_S         0U
#define MCAN_RXF0A_F0AI_M         0x3FU        // Rx FIFO 0 Acknowledge Index

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXBC register
//
//*****************************************************************************
#define MCAN_RXBC_RBSA_S          2U
#define MCAN_RXBC_RBSA_M          0xFFFCU      // Rx Buffer Start Address

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXF1C register
//
//*****************************************************************************
#define MCAN_RXF1C_F1SA_S         2U
#define MCAN_RXF1C_F1SA_M         0xFFFCU      // Rx FIFO 1 Start Address
#define MCAN_RXF1C_F1S_S          16U
#define MCAN_RXF1C_F1S_M          0x7F0000U    // Rx FIFO 1 Size
#define MCAN_RXF1C_F1WM_S         24U
#define MCAN_RXF1C_F1WM_M         0x7F000000U  // Rx FIFO 1 Watermark
#define MCAN_RXF1C_F1OM           0x80000000U  // FIFO 1 Operation Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXF1S register
//
//*****************************************************************************
#define MCAN_RXF1S_F1FL_S         0U
#define MCAN_RXF1S_F1FL_M         0x7FU        // Rx FIFO 1 Fill Level
#define MCAN_RXF1S_F1GI_S         8U
#define MCAN_RXF1S_F1GI_M         0x3F00U      // Rx FIFO 1 Get Index
#define MCAN_RXF1S_F1PI_S         16U
#define MCAN_RXF1S_F1PI_M         0x3F0000U    // Rx FIFO 1 Put Index
#define MCAN_RXF1S_F1F            0x1000000U   // Rx FIFO 1 Full
#define MCAN_RXF1S_RF1L           0x2000000U   // Rx FIFO 1 Message Lost
#define MCAN_RXF1S_DMS_S          30U
#define MCAN_RXF1S_DMS_M          0xC0000000U  // Debug Message Status

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXF1A register
//
//*****************************************************************************
#define MCAN_RXF1A_F1AI_S         0U
#define MCAN_RXF1A_F1AI_M         0x3FU        // Rx FIFO 1 Acknowledge Index

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_RXESC register
//
//*****************************************************************************
#define MCAN_RXESC_F0DS_S         0U
#define MCAN_RXESC_F0DS_M         0x7U         // Rx FIFO 0 Data Field Size
#define MCAN_RXESC_F1DS_S         4U
#define MCAN_RXESC_F1DS_M         0x70U        // Rx FIFO 1 Data Field Size
#define MCAN_RXESC_RBDS_S         8U
#define MCAN_RXESC_RBDS_M         0x700U       // Rx Buffer Data Field Size

