hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/inc/hw_mcan.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBC register
//
//*****************************************************************************
#define MCAN_TXBC_TBSA_S          2U
#define MCAN_TXBC_TBSA_M          0xFFFCU      // Tx Buffers Start Address
#define MCAN_TXBC_NDTB_S          16U
#define MCAN_TXBC_NDTB_M          0x3F0000U    // Number of Dedicated Transmit
                                               // Buffers
#define MCAN_TXBC_TFQS_S          24U
#define MCAN_TXBC_TFQS_M          0x3F000000U  // Transmit FIFO/Queue Size
#define MCAN_TXBC_TFQM            0x40000000U  // Tx FIFO/Queue Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXFQS register
//
//*****************************************************************************
#define MCAN_TXFQS_TFFL_S         0U
#define MCAN_TXFQS_TFFL_M         0x3FU        // Tx FIFO Free Level
#define MCAN_TXFQS_TFGI_S         8U
#define MCAN_TXFQS_TFGI_M         0x1F00U      // Tx FIFO Get Index
#define MCAN_TXFQS_TFQP_S         16U
#define MCAN_TXFQS_TFQP_M         0x1F0000U    // Tx FIFO/Queue Put Index
#define MCAN_TXFQS_TFQF           0x200000U    // Tx FIFO/Queue Full

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXESC register
//
//*****************************************************************************
#define MCAN_TXESC_TBDS_S         0U
#define MCAN_TXESC_TBDS_M         0x7U         // Tx Buffer Data Field Size

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBRP register
//
//*****************************************************************************
#define MCAN_TXBRP_TRP0           0x1U         // Transmission Request Pending
                                               // 0
#define MCAN_TXBRP_TRP1           0x2U         // Transmission Request Pending
                                               // 1
#define MCAN_TXBRP_TRP2           0x4U         // Transmission Request Pending
                                               // 2
#define MCAN_TXBRP_TRP3           0x8U         // Transmission Request Pending
                                               // 3
#define MCAN_TXBRP_TRP4           0x10U        // Transmission Request Pending
                                               // 4
#define MCAN_TXBRP_TRP5           0x20U        // Transmission Request Pending
                                               // 5
#define MCAN_TXBRP_TRP6           0x40U        // Transmission Request Pending
                                               // 6
#define MCAN_TXBRP_TRP7           0x80U        // Transmission Request Pending
                                               // 7
#define MCAN_TXBRP_TRP8           0x100U       // Transmission Request Pending
                                               // 8
#define MCAN_TXBRP_TRP9           0x200U       // Transmission Request Pending
                                               // 9
#define MCAN_TXBRP_TRP10          0x400U       // Transmission Request Pending
                                               // 10
#define MCAN_TXBRP_TRP11          0x800U       // Transmission Request Pending
                                               // 11
#define MCAN_TXBRP_TRP12          0x1000U      // Transmission Request Pending
                                               // 12
#define MCAN_TXBRP_TRP13          0x2000U      // Transmission Request Pending
                                               // 13
#define MCAN_TXBRP_TRP14          0x4000U      // Transmission Request Pending
                                               // 14
#define MCAN_TXBRP_TRP15          0x8000U      // Transmission Request Pending
                                               // 15
#define MCAN_TXBRP_TRP16          0x10000U     // Transmission Request Pending
                                               // 16
#define MCAN_TXBRP_TRP17          0x20000U     // Transmission Request Pending
                                               // 17
#define MCAN_TXBRP_TRP18          0x40000U     // Transmission Request Pending
                                               // 18
#define MCAN_TXBRP_TRP19          0x80000U     // Transmission Request Pending
                                               // 19
#define MCAN_TXBRP_TRP20          0x100000U    // Transmission Request Pending
                                               // 20
#define MCAN_TXBRP_TRP21          0x200000U    // Transmission Request Pending
                                               // 21
#define MCAN_TXBRP_TRP22          0x400000U    // Transmission Request Pending
                                               // 22
#define MCAN_TXBRP_TRP23          0x800000U    // Transmission Request Pending
                                               // 23
#define MCAN_TXBRP_TRP24          0x1000000U   // Transmission Request Pending
                                               // 24
#define MCAN_TXBRP_TRP25          0x2000000U   // Transmission Request Pending
                                               // 25
#define MCAN_TXBRP_TRP26          0x4000000U   // Transmission Request Pending
                                               // 26
#define MCAN_TXBRP_TRP27          0x8000000U   // Transmission Request Pending
                                               // 27
#define MCAN_TXBRP_TRP28          0x10000000U  // Transmission Request Pending
                                               // 28
#define MCAN_TXBRP_TRP29          0x20000000U  // Transmission Request Pending
                                               // 29
#define MCAN_TXBRP_TRP30          0x40000000U  // Transmission Request Pending
                                               // 30
#define MCAN_TXBRP_TRP31          0x80000000U  // Transmission Request Pending
                                               // 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBAR register
//
//*****************************************************************************
#define MCAN_TXBAR_AR0            0x1U         // Add Request 0
#define MCAN_TXBAR_AR1            0x2U         // Add Request 1
#define MCAN_TXBAR_AR2            0x4U         // Add Request 2
#define MCAN_TXBAR_AR3            0x8U         // Add Request 3
#define MCAN_TXBAR_AR4            0x10U        // Add Request 4
#define MCAN_TXBAR_AR5            0x20U        // Add Request 5
#define MCAN_TXBAR_AR6            0x40U        // Add Request 6
#define MCAN_TXBAR_AR7            0x80U        // Add Request 7
#define MCAN_TXBAR_AR8            0x100U       // Add Request 8
#define MCAN_TXBAR_AR9            0x200U       // Add Request 9
#define MCAN_TXBAR_AR10           0x400U       // Add Request 10
#define MCAN_TXBAR_AR11           0x800U       // Add Request 11
#define MCAN_TXBAR_AR12           0x1000U      // Add Request 12
#define MCAN_TXBAR_AR13           0x2000U      // Add Request 13
#define MCAN_TXBAR_AR14           0x4000U      // Add Request 14
#define MCAN_TXBAR_AR15           0x8000U      // Add Request 15
#define MCAN_TXBAR_AR16           0x10000U     // Add Request 16
#define MCAN_TXBAR_AR17           0x20000U     // Add Request 17
#define MCAN_TXBAR_AR18           0x40000U     // Add Request 18
#define MCAN_TXBAR_AR19           0x80000U     // Add Request 19
#define MCAN_TXBAR_AR20           0x100000U    // Add Request 20
#define MCAN_TXBAR_AR21           0x200000U    // Add Request 21
#define MCAN_TXBAR_AR22           0x400000U    // Add Request 22
#define MCAN_TXBAR_AR23           0x800000U    // Add Request 23
#define MCAN_TXBAR_AR24           0x1000000U   // Add Request 24
#define MCAN_TXBAR_AR25           0x2000000U   // Add Request 25
#define MCAN_TXBAR_AR26           0x4000000U   // Add Request 26
#define MCAN_TXBAR_AR27           0x8000000U   // Add Request 27
#define MCAN_TXBAR_AR28           0x10000000U  // Add Request 28
#define MCAN_TXBAR_AR29           0x20000000U  // Add Request 29
#define MCAN_TXBAR_AR30           0x40000000U  // Add Request 30
#define MCAN_TXBAR_AR31           0x80000000U  // Add Request 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBCR register
//
//*****************************************************************************
#define MCAN_TXBCR_CR0            0x1U         // Cancellation Request 0
#define MCAN_TXBCR_CR1            0x2U         // Cancellation Request 1
#define MCAN_TXBCR_CR2            0x4U         // Cancellation Request 2
#define MCAN_TXBCR_CR3            0x8U         // Cancellation Request 3
#define MCAN_TXBCR_CR4            0x10U        // Cancellation Request 4
#define MCAN_TXBCR_CR5            0x20U        // Cancellation Request 5
#define MCAN_TXBCR_CR6            0x40U        // Cancellation Request 6
#define MCAN_TXBCR_CR7            0x80U        // Cancellation Request 7
#define MCAN_TXBCR_CR8            0x100U       // Cancellation Request 8
#define MCAN_TXBCR_CR9            0x200U       // Cancellation Request 9
#define MCAN_TXBCR_CR10           0x400U       // Cancellation Request 10
#define MCAN_TXBCR_CR11           0x800U       // Cancellation Request 11
#define MCAN_TXBCR_CR12           0x1000U      // Cancellation Request 12
#define MCAN_TXBCR_CR13           0x2000U      // Cancellation Request 13
#define MCAN_TXBCR_CR14           0x4000U      // Cancellation Request 14
#define MCAN_TXBCR_CR15           0x8000U      // Cancellation Request 15
#define MCAN_TXBCR_CR16           0x10000U     // Cancellation Request 16
#define MCAN_TXBCR_CR17           0x20000U     // Cancellation Request 17
#define MCAN_TXBCR_CR18           0x40000U     // Cancellation Request 18
#define MCAN_TXBCR_CR19           0x80000U     // Cancellation Request 19
#define MCAN_TXBCR_CR20           0x100000U    // Cancellation Request 20
#define MCAN_TXBCR_CR21           0x200000U    // Cancellation Request 21
#define MCAN_TXBCR_CR22           0x400000U    // Cancellation Request 22
#define MCAN_TXBCR_CR23           0x800000U    // Cancellation Request 23
#define MCAN_TXBCR_CR24           0x1000000U   // Cancellation Request 24
#define MCAN_TXBCR_CR25           0x2000000U   // Cancellation Request 25
#define MCAN_TXBCR_CR26           0x4000000U   // Cancellation Request 26
#define MCAN_TXBCR_CR27           0x8000000U   // Cancellation Request 27
#define MCAN_TXBCR_CR28           0x10000000U  // Cancellation Request 28
#define MCAN_TXBCR_CR29           0x20000000U  // Cancellation Request 29
#define MCAN_TXBCR_CR30           0x40000000U  // Cancellation Request 30
#define MCAN_TXBCR_CR31           0x80000000U  // Cancellation Request 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBTO register
//
//*****************************************************************************
#define MCAN_TXBTO_TO0            0x1U         // Transmission Occurred 0
#define MCAN_TXBTO_TO1            0x2U         // Transmission Occurred 1
#define MCAN_TXBTO_TO2            0x4U         // Transmission Occurred 2
#define MCAN_TXBTO_TO3            0x8U         // Transmission Occurred 3
#define MCAN_TXBTO_TO4            0x10U        // Transmission Occurred 4
#define MCAN_TXBTO_TO5            0x20U        // Transmission Occurred 5
#define MCAN_TXBTO_TO6            0x40U        // Transmission Occurred 6
#define MCAN_TXBTO_TO7            0x80U        // Transmission Occurred 7
#define MCAN_TXBTO_TO8            0x100U       // Transmission Occurred 8
#define MCAN_TXBTO_TO9            0x200U       // Transmission Occurred 9
#define MCAN_TXBTO_TO10           0x400U       // Transmission Occurred 10
#define MCAN_TXBTO_TO11           0x800U       // Transmission Occurred 11
#define MCAN_TXBTO_TO12           0x1000U      // Transmission Occurred 12
#define MCAN_TXBTO_TO13           0x2000U      // Transmission Occurred 13
#define MCAN_TXBTO_TO14           0x4000U      // Transmission Occurred 14
#define MCAN_TXBTO_TO15           0x8000U      // Transmission Occurred 15
#define MCAN_TXBTO_TO16           0x10000U     // Transmission Occurred 16
#define MCAN_TXBTO_TO17           0x20000U     // Transmission Occurred 17
#define MCAN_TXBTO_TO18           0x40000U     // Transmission Occurred 18
#define MCAN_TXBTO_TO19           0x80000U     // Transmission Occurred 19
#define MCAN_TXBTO_TO20           0x100000U    // Transmission Occurred 20
#define MCAN_TXBTO_TO21           0x200000U    // Transmission Occurred 21
#define MCAN_TXBTO_TO22           0x400000U    // Transmission Occurred 22
#define MCAN_TXBTO_TO23           0x800000U    // Transmission Occurred 23
#define MCAN_TXBTO_TO24           0x1000000U   // Transmission Occurred 24
#define MCAN_TXBTO_TO25           0x2000000U   // Transmission Occurred 25
#define MCAN_TXBTO_TO26           0x4000000U   // Transmission Occurred 26
#define MCAN_TXBTO_TO27           0x8000000U   // Transmission Occurred 27
#define MCAN_TXBTO_TO28           0x10000000U  // Transmission Occurred 28
#define MCAN_TXBTO_TO29           0x20000000U  // Transmission Occurred 29
#define MCAN_TXBTO_TO30           0x40000000U  // Transmission Occurred 30
#define MCAN_TXBTO_TO31           0x80000000U  // Transmission Occurred 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBCF register
//
//*****************************************************************************
#define MCAN_TXBCF_CF0            0x1U         // Cancellation Finished 0
#define MCAN_TXBCF_CF1            0x2U         // Cancellation Finished 1
#define MCAN_TXBCF_CF2            0x4U         // Cancellation Finished 2
#define MCAN_TXBCF_CF3            0x8U         // Cancellation Finished 3
#define MCAN_TXBCF_CF4            0x10U        // Cancellation Finished 4
#define MCAN_TXBCF_CF5            0x20U        // Cancellation Finished 5
#define MCAN_TXBCF_CF6            0x40U        // Cancellation Finished 6
#define MCAN_TXBCF_CF7            0x80U        // Cancellation Finished 7
#define MCAN_TXBCF_CF8            0x100U       // Cancellation Finished 8
#define MCAN_TXBCF_CF9            0x200U       // Cancellation Finished 9
#define MCAN_TXBCF_CF10           0x400U       // Cancellation Finished 10
#define MCAN_TXBCF_CF11           0x800U       // Cancellation Finished 11
#define MCAN_TXBCF_CF12           0x1000U      // Cancellation Finished 12
#define MCAN_TXBCF_CF13           0x2000U      // Cancellation Finished 13
#define MCAN_TXBCF_CF14           0x4000U      // Cancellation Finished 14
#define MCAN_TXBCF_CF15           0x8000U      // Cancellation Finished 15
#define MCAN_TXBCF_CF16           0x10000U     // Cancellation Finished 16
#define MCAN_TXBCF_CF17           0x20000U     // Cancellation Finished 17
#define MCAN_TXBCF_CF18           0x40000U     // Cancellation Finished 18
#define MCAN_TXBCF_CF19           0x80000U     // Cancellation Finished 19
#define MCAN_TXBCF_CF20           0x100000U    // Cancellation Finished 20
#define MCAN_TXBCF_CF21           0x200000U    // Cancellation Finished 21
#define MCAN_TXBCF_CF22           0x400000U    // Cancellation Finished 22
#define MCAN_TXBCF_CF23           0x800000U    // Cancellation Finished 23
#define MCAN_TXBCF_CF24           0x1000000U   // Cancellation Finished 24
#define MCAN_TXBCF_CF25           0x2000000U   // Cancellation Finished 25
#define MCAN_TXBCF_CF26           0x4000000U   // Cancellation Finished 26
#define MCAN_TXBCF_CF27           0x8000000U   // Cancellation Finished 27
#define MCAN_TXBCF_CF28           0x10000000U  // Cancellation Finished 28
#define MCAN_TXBCF_CF29           0x20000000U  // Cancellation Finished 29
#define MCAN_TXBCF_CF30           0x40000000U  // Cancellation Finished 30
#define MCAN_TXBCF_CF31           0x80000000U  // Cancellation Finished 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBTIE register
//
//*****************************************************************************
#define MCAN_TXBTIE_TIE0          0x1U         // Transmission Interrupt Enable
                                               // 0
#define MCAN_TXBTIE_TIE1          0x2U         // Transmission Interrupt Enable
                                               // 1
#define MCAN_TXBTIE_TIE2          0x4U         // Transmission Interrupt Enable
                                               // 2
#define MCAN_TXBTIE_TIE3          0x8U         // Transmission Interrupt Enable
                                               // 3
#define MCAN_TXBTIE_TIE4          0x10U        // Transmission Interrupt Enable
                                               // 4
#define MCAN_TXBTIE_TIE5          0x20U        // Transmission Interrupt Enable
                                               // 5
#define MCAN_TXBTIE_TIE6          0x40U        // Transmission Interrupt Enable
                                               // 6
#define MCAN_TXBTIE_TIE7          0x80U        // Transmission Interrupt Enable
                                               // 7
#define MCAN_TXBTIE_TIE8          0x100U       // Transmission Interrupt Enable
                                               // 8
#define MCAN_TXBTIE_TIE9          0x200U       // Transmission Interrupt Enable
                                               // 9
#define MCAN_TXBTIE_TIE10         0x400U       // Transmission Interrupt Enable
                                               // 10
#define MCAN_TXBTIE_TIE11         0x800U       // Transmission Interrupt Enable
                                               // 11
#define MCAN_TXBTIE_TIE12         0x1000U      // Transmission Interrupt Enable
                                               // 12
#define MCAN_TXBTIE_TIE13         0x2000U      // Transmission Interrupt Enable
                                               // 13
#define MCAN_TXBTIE_TIE14         0x4000U      // Transmission Interrupt Enable
                                               // 14
#define MCAN_TXBTIE_TIE15         0x8000U      // Transmission Interrupt Enable
                                               // 15
#define MCAN_TXBTIE_TIE16         0x10000U     // Transmission Interrupt Enable
                                               // 16
#define MCAN_TXBTIE_TIE17         0x20000U     // Transmission Interrupt Enable
                                               // 17
#define MCAN_TXBTIE_TIE18         0x40000U     // Transmission Interrupt Enable
                                               // 18
#define MCAN_TXBTIE_TIE19         0x80000U     // Transmission Interrupt Enable
                                               // 19
#define MCAN_TXBTIE_TIE20         0x100000U    // Transmission Interrupt Enable
                                               // 20
#define MCAN_TXBTIE_TIE21         0x200000U    // Transmission Interrupt Enable
                                               // 21
#define MCAN_TXBTIE_TIE22         0x400000U    // Transmission Interrupt Enable
                                               // 22
#define MCAN_TXBTIE_TIE23         0x800000U    // Transmission Interrupt Enable
                                               // 23
#define MCAN_TXBTIE_TIE24         0x1000000U   // Transmission Interrupt Enable
                                               // 24
#define MCAN_TXBTIE_TIE25         0x2000000U   // Transmission Interrupt Enable
                                               // 25
#define MCAN_TXBTIE_TIE26         0x4000000U   // Transmission Interrupt Enable
                                               // 26
#define MCAN_TXBTIE_TIE27         0x8000000U   // Transmission Interrupt Enable
                                               // 27
#define MCAN_TXBTIE_TIE28         0x10000000U  // Transmission Interrupt Enable
                                               // 28
#define MCAN_TXBTIE_TIE29         0x20000000U  // Transmission Interrupt Enable
                                               // 29
#define MCAN_TXBTIE_TIE30         0x40000000U  // Transmission Interrupt Enable
                                               // 30
#define MCAN_TXBTIE_TIE31         0x80000000U  // Transmission Interrupt Enable
                                               // 31

