hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/inc/hw_mcan.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXBCIE register
//
//*****************************************************************************
#define MCAN_TXBCIE_CFIE0         0x1U         // Cancellation Finished
                                               // Interrupt Enable 0
#define MCAN_TXBCIE_CFIE1         0x2U         // Cancellation Finished
                                               // Interrupt Enable 1
#define MCAN_TXBCIE_CFIE2         0x4U         // Cancellation Finished
                                               // Interrupt Enable 2
#define MCAN_TXBCIE_CFIE3         0x8U         // Cancellation Finished
                                               // Interrupt Enable 3
#define MCAN_TXBCIE_CFIE4         0x10U        // Cancellation Finished
                                               // Interrupt Enable 4
#define MCAN_TXBCIE_CFIE5         0x20U        // Cancellation Finished
                                               // Interrupt Enable 5
#define MCAN_TXBCIE_CFIE6         0x40U        // Cancellation Finished
                                               // Interrupt Enable 6
#define MCAN_TXBCIE_CFIE7         0x80U        // Cancellation Finished
                                               // Interrupt Enable 7
#define MCAN_TXBCIE_CFIE8         0x100U       // Cancellation Finished
                                               // Interrupt Enable 8
#define MCAN_TXBCIE_CFIE9         0x200U       // Cancellation Finished
                                               // Interrupt Enable 9
#define MCAN_TXBCIE_CFIE10        0x400U       // Cancellation Finished
                                               // Interrupt Enable 10
#define MCAN_TXBCIE_CFIE11        0x800U       // Cancellation Finished
                                               // Interrupt Enable 11
#define MCAN_TXBCIE_CFIE12        0x1000U      // Cancellation Finished
                                               // Interrupt Enable 12
#define MCAN_TXBCIE_CFIE13        0x2000U      // Cancellation Finished
                                               // Interrupt Enable 13
#define MCAN_TXBCIE_CFIE14        0x4000U      // Cancellation Finished
                                               // Interrupt Enable 14
#define MCAN_TXBCIE_CFIE15        0x8000U      // Cancellation Finished
                                               // Interrupt Enable 15
#define MCAN_TXBCIE_CFIE16        0x10000U     // Cancellation Finished
                                               // Interrupt Enable 16
#define MCAN_TXBCIE_CFIE17        0x20000U     // Cancellation Finished
                                               // Interrupt Enable 17
#define MCAN_TXBCIE_CFIE18        0x40000U     // Cancellation Finished
                                               // Interrupt Enable 18
#define MCAN_TXBCIE_CFIE19        0x80000U     // Cancellation Finished
                                               // Interrupt Enable 19
#define MCAN_TXBCIE_CFIE20        0x100000U    // Cancellation Finished
                                               // Interrupt Enable 20
#define MCAN_TXBCIE_CFIE21        0x200000U    // Cancellation Finished
                                               // Interrupt Enable 21
#define MCAN_TXBCIE_CFIE22        0x400000U    // Cancellation Finished
                                               // Interrupt Enable 22
#define MCAN_TXBCIE_CFIE23        0x800000U    // Cancellation Finished
                                               // Interrupt Enable 23
#define MCAN_TXBCIE_CFIE24        0x1000000U   // Cancellation Finished
                                               // Interrupt Enable 24
#define MCAN_TXBCIE_CFIE25        0x2000000U   // Cancellation Finished
                                               // Interrupt Enable 25
#define MCAN_TXBCIE_CFIE26        0x4000000U   // Cancellation Finished
                                               // Interrupt Enable 26
#define MCAN_TXBCIE_CFIE27        0x8000000U   // Cancellation Finished
                                               // Interrupt Enable 27
#define MCAN_TXBCIE_CFIE28        0x10000000U  // Cancellation Finished
                                               // Interrupt Enable 28
#define MCAN_TXBCIE_CFIE29        0x20000000U  // Cancellation Finished
                                               // Interrupt Enable 29
#define MCAN_TXBCIE_CFIE30        0x40000000U  // Cancellation Finished
                                               // Interrupt Enable 30
#define MCAN_TXBCIE_CFIE31        0x80000000U  // Cancellation Finished
                                               // Interrupt Enable 31

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXEFC register
//
//*****************************************************************************
#define MCAN_TXEFC_EFSA_S         2U
#define MCAN_TXEFC_EFSA_M         0xFFFCU      // Event FIFO Start Address
#define MCAN_TXEFC_EFS_S          16U
#define MCAN_TXEFC_EFS_M          0x3F0000U    // Event FIFO Size
#define MCAN_TXEFC_EFWM_S         24U
#define MCAN_TXEFC_EFWM_M         0x3F000000U  // Event FIFO Watermark

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXEFS register
//
//*****************************************************************************
#define MCAN_TXEFS_EFFL_S         0U
#define MCAN_TXEFS_EFFL_M         0x3FU        // Event FIFO Fill Level
#define MCAN_TXEFS_EFGI_S         8U
#define MCAN_TXEFS_EFGI_M         0x1F00U      // Event FIFO Get Index
#define MCAN_TXEFS_EFPI_S         16U
#define MCAN_TXEFS_EFPI_M         0x1F0000U    // Event FIFO Put Index
#define MCAN_TXEFS_EFF            0x1000000U   // Event FIFO Full
#define MCAN_TXEFS_TEFL           0x2000000U   // Tx Event FIFO Element Lost

//*****************************************************************************
//
// The following are defines for the bit fields in the MCAN_TXEFA register
//
//*****************************************************************************
#define MCAN_TXEFA_EFAI_S         0U
#define MCAN_TXEFA_EFAI_M         0x1FU        // Event FIFO Acknowledge Index

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_REV register
//
//*****************************************************************************
#define MCAN_ERR_REV_REVMIN_S     0U
#define MCAN_ERR_REV_REVMIN_M     0x3FU        // Minor Revision
#define MCAN_ERR_REV_REVCUSTOM_S  6U
#define MCAN_ERR_REV_REVCUSTOM_M  0xC0U        // Custom Revision
#define MCAN_ERR_REV_REVMAJ_S     8U
#define MCAN_ERR_REV_REVMAJ_M     0x700U       // Major Revision
#define MCAN_ERR_REV_REVRTL_S     11U
#define MCAN_ERR_REV_REVRTL_M     0xF800U      // RTL Revision
#define MCAN_ERR_REV_MODULE_ID_S  16U
#define MCAN_ERR_REV_MODULE_ID_M  0xFFF0000U   // Module Identification Number
#define MCAN_ERR_REV_BU_S         28U
#define MCAN_ERR_REV_BU_M         0x30000000U  // Business Unit
#define MCAN_ERR_REV_SCHEME_S     30U
#define MCAN_ERR_REV_SCHEME_M     0xC0000000U  // PID Register Scheme

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_VECTOR register
//
//*****************************************************************************
#define MCAN_ERR_VECTOR_ECC_VECTOR_S  0U
#define MCAN_ERR_VECTOR_ECC_VECTOR_M  0x7FFU       // ECC RAM ID
#define MCAN_ERR_VECTOR_RD_SVBUS  0x8000U      // Read Trigger
#define MCAN_ERR_VECTOR_RD_SBVUS_ADDRESS_S  16U
#define MCAN_ERR_VECTOR_RD_SBVUS_ADDRESS_M  0xFF0000U    // Read Address Offset
#define MCAN_ERR_VECTOR_RD_SVBUS_DONE  0x1000000U   // Read Completion Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_STAT register
//
//*****************************************************************************
#define MCAN_ERR_STAT_NUM_RAMS_S  0U
#define MCAN_ERR_STAT_NUM_RAMS_M  0x7FFU       // Number of RAMs

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_WRAP_REV register
//
//*****************************************************************************
#define MCAN_ERR_WRAP_REV_REVMIN_S  0U
#define MCAN_ERR_WRAP_REV_REVMIN_M  0x3FU        // Minor Revision
#define MCAN_ERR_WRAP_REV_REVCUSTOM_S  6U
#define MCAN_ERR_WRAP_REV_REVCUSTOM_M  0xC0U        // Custom Revision
#define MCAN_ERR_WRAP_REV_REVMAJ_S  8U
#define MCAN_ERR_WRAP_REV_REVMAJ_M  0x700U       // Major Revision
#define MCAN_ERR_WRAP_REV_REVRTL_S  11U
#define MCAN_ERR_WRAP_REV_REVRTL_M  0xF800U      // RTL Revision
#define MCAN_ERR_WRAP_REV_MODULE_ID_S  16U
#define MCAN_ERR_WRAP_REV_MODULE_ID_M  0xFFF0000U   // Module Identification Number
#define MCAN_ERR_WRAP_REV_BU_S    28U
#define MCAN_ERR_WRAP_REV_BU_M    0x30000000U  // Business Unit
#define MCAN_ERR_WRAP_REV_SCHEME_S  30U
#define MCAN_ERR_WRAP_REV_SCHEME_M  0xC0000000U  // PID Register Scheme

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_CTRL register
//
//*****************************************************************************
#define MCAN_ERR_CTRL_ECC_ENABLE  0x1U         // Enable ECC Generation
#define MCAN_ERR_CTRL_ECC_CHECK   0x2U         // Enable ECC Check
#define MCAN_ERR_CTRL_ENABLE_RMW  0x4U         // Enable Read-Modify-Write
#define MCAN_ERR_CTRL_FORCE_SEC   0x8U         // Force Single Bit Error
                                               // Corrected Error
#define MCAN_ERR_CTRL_FORCE_DED   0x10U        // Force Double Bit Error
                                               // Detected Error
#define MCAN_ERR_CTRL_FORCE_N_ROW  0x20U        // Force Next Single/Double Bit
                                               // Error
#define MCAN_ERR_CTRL_ERROR_ONCE  0x40U        // Force Error Only Once Enable
#define MCAN_ERR_CTRL_CHECK_SVBUS_TIMEOUT  0x100U       // SVBUS Timeout Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_ERR_CTRL2 register
//
//*****************************************************************************
#define MCAN_ERR_ERR_CTRL2_ECC_BIT1_S  0U
#define MCAN_ERR_ERR_CTRL2_ECC_BIT1_M  0xFFFFU      // Force Error Bit1 Column Index
#define MCAN_ERR_ERR_CTRL2_ECC_BIT2_S  16U
#define MCAN_ERR_ERR_CTRL2_ECC_BIT2_M  0xFFFF0000U  // Force Error Bit2 Column Index

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_ERR_STAT1 register
//
//*****************************************************************************
#define MCAN_ERR_ERR_STAT1_ECC_SEC_S  0U
#define MCAN_ERR_ERR_STAT1_ECC_SEC_M  0x3U         // Single Bit Error Corrected
                                               // Status
#define MCAN_ERR_ERR_STAT1_ECC_DED_S  2U
#define MCAN_ERR_ERR_STAT1_ECC_DED_M  0xCU         // Double Bit Error Detected
                                               // Status
#define MCAN_ERR_ERR_STAT1_ECC_OTHER  0x10U        // SEC While Writeback Error
                                               // Status
#define MCAN_ERR_ERR_STAT1_CTRL_REG_ERROR  0x80U        // Control Register Error
#define MCAN_ERR_ERR_STAT1_CLR_ECC_SEC_S  8U
#define MCAN_ERR_ERR_STAT1_CLR_ECC_SEC_M  0x300U       // Clear ECC_SEC
#define MCAN_ERR_ERR_STAT1_CLR_ECC_DED_S  10U
#define MCAN_ERR_ERR_STAT1_CLR_ECC_DED_M  0xC00U       // Clear ECC_DED
#define MCAN_ERR_ERR_STAT1_CLR_ECC_OTHER  0x1000U      // Clear ECC_OTHER
#define MCAN_ERR_ERR_STAT1_CLR_CTRL_REG_ERROR  0x8000U      // Clear Control Register Error
#define MCAN_ERR_ERR_STAT1_ECC_BIT1_S  16U
#define MCAN_ERR_ERR_STAT1_ECC_BIT1_M  0xFFFF0000U  // ECC Error Bit Position

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_ERR_STAT3 register
//
//*****************************************************************************
#define MCAN_ERR_ERR_STAT3_WB_PEND  0x1U         // Delayed Write Back Pending
                                               // Status
#define MCAN_ERR_ERR_STAT3_SVBUS_TIMEOUT  0x2U         // Serial VBUS Timeout Flag
#define MCAN_ERR_ERR_STAT3_CLR_SVBUS_TIMEOUT  0x200U       // Clear Serial VBUS Timeout

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_SEC_EOI register
//
//*****************************************************************************
#define MCAN_ERR_SEC_EOI_EOI_WR   0x1U         // End of Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_SEC_STATUS register
//
//*****************************************************************************
#define MCAN_ERR_SEC_STATUS_MSGMEM_PEND  0x1U         // Message RAM SEC Interrupt
                                               // Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_SEC_ENABLE_SET register
//
//*****************************************************************************
#define MCAN_ERR_SEC_ENABLE_SET_MSGMEM_ENABLE_SET  0x1U         // Message RAM SEC Interrupt
                                               // Pending Enable Set

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_SEC_ENABLE_CLR register
//
//*****************************************************************************
#define MCAN_ERR_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR  0x1U         // Message RAM SEC Interrupt
                                               // Pending Enable Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_EOI register
//
//*****************************************************************************
#define MCAN_ERR_DED_EOI_EOI_WR   0x1U         // End of Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_STATUS register
//
//*****************************************************************************
#define MCAN_ERR_DED_STATUS_MSGMEM_PEND  0x1U         // Message RAM DED Interrupt
                                               // Pending
#define MCAN_ERR_DED_STATUS_TXDMAREQ_PEND  0x2U         // TX Empty DMA Request Parity
                                               // Interrupt Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_ENABLE_SET register
//
//*****************************************************************************
#define MCAN_ERR_DED_ENABLE_SET_MSGMEM_ENABLE_SET  0x1U         // Message RAM DED Interrupt
                                               // Pending Enable Set
#define MCAN_ERR_DED_ENABLE_SET_TXDMAREQ_ENABLE_SET  0x2U         // TX Empty DMA Request Parity
                                               // Interrupt Pending Enable Set

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_DED_ENABLE_CLR register
//
//*****************************************************************************
#define MCAN_ERR_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR  0x1U         // Message RAM DED Interrupt
                                               // Pending Enable Clear
#define MCAN_ERR_DED_ENABLE_CLR_TXDMAREQ_ENABLE_CLR  0x2U         // TX Empty DMA Request Parity
                                               // Interrupt Pending Enable Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_ENABLE_SET register
//
//*****************************************************************************
#define MCAN_ERR_AGGR_ENABLE_SET_ENABLE_PARITY_SET  0x1U         // Enable Parity Errors Set
#define MCAN_ERR_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET  0x2U         // Enable Timeout Errors Set

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_ENABLE_CLR register
//
//*****************************************************************************
#define MCAN_ERR_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR  0x1U         // Enable Parity Errors Clear
#define MCAN_ERR_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR  0x2U         // Enable Timeout Errors Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_STATUS_SET register
//
//*****************************************************************************
#define MCAN_ERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_S  0U
#define MCAN_ERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_M  0x3U         // Aggregator Parity Error
                                               // Status
#define MCAN_ERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_S  2U
#define MCAN_ERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_M  0xCU         // Aggregator Serial VBUS
                                               // Timeout Error Status

//*****************************************************************************
//
// The following are defines for the bit fields in the MCANERR_AGGR_STATUS_CLR register
//
//*****************************************************************************
#define MCAN_ERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_S  0U
#define MCAN_ERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_M  0x3U         // Aggregator Parity Error
                                               // Status
#define MCAN_ERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_S  2U
#define MCAN_ERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_M  0xCU         // Aggregator Serial VBUS
                                               // Timeout Error Status
#endif
